package com.agaperra.todo.data

import com.agaperra.todo.data.model.Levels
import com.agaperra.todo.data.model.Note

object  DataProvider {

    val note = Note(
        1,
        "Первая заметка",
        Levels.LOW,
        "24.09.2021 17:12:53",
        "24.09.2021 17:12:53",
        "Первая заметочка"
    )

    val notesList = ArrayList<Note>()

    val notesList1 = listOf(
        note,
        Note(
            2,
            "Вторая заметка",
            Levels.LOW,
            "24.09.2021 17:14:53",
            "24.09.2021 17:14:53",
            "2 заметочка"
        ),
        Note(
            3,
            "3 заметка",
            Levels.HIGH,
            "24.09.2021 17:15:53",
            "24.09.2021 17:15:53",
            "3 заметочка"
        ),
        Note(
            4,
            "4 заметка",
            Levels.LOW,
            "24.09.2021 17:16:00",
            "24.09.2021 17:16:00",
            "4 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        ),
        Note(
            5,
            "5 заметка",
            Levels.MEDIUM,
            "24.09.2021 17:17:00",
            "24.09.2021 17:17:00",
            "5 заметочка"
        )
    )
}